zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_trng.h
/* TRNG_DESC Bits */
/* TRNG_DESC[MINREV] Bits */
#define TRNG_DESC_MINREV_OFS                     (0)                             /* !< MINREV Offset */
#define TRNG_DESC_MINREV_MASK                    ((uint32_t)0x0000000FU)         /* !< Minor rev of the IP */
/* TRNG_DESC[MAJREV] Bits */
#define TRNG_DESC_MAJREV_OFS                     (4)                             /* !< MAJREV Offset */
#define TRNG_DESC_MAJREV_MASK                    ((uint32_t)0x000000F0U)         /* !< Major rev of the IP */
/* TRNG_DESC[INSTNUM] Bits */
#define TRNG_DESC_INSTNUM_OFS                    (8)                             /* !< INSTNUM Offset */
#define TRNG_DESC_INSTNUM_MASK                   ((uint32_t)0x00000F00U)         /* !< Instance Number within the device.
                                                                                    This will be a parameter to the RTL
                                                                                    for modules that can have multiple
                                                                                    instances */
/* TRNG_DESC[FEATUREVER] Bits */
#define TRNG_DESC_FEATUREVER_OFS                 (12)                            /* !< FEATUREVER Offset */
#define TRNG_DESC_FEATUREVER_MASK                ((uint32_t)0x0000F000U)         /* !< Feature Set for the module
                                                                                    *instance* */
/* TRNG_DESC[MODULEID] Bits */
#define TRNG_DESC_MODULEID_OFS                   (16)                            /* !< MODULEID Offset */
#define TRNG_DESC_MODULEID_MASK                  ((uint32_t)0xFFFF0000U)         /* !< Module Identifier - An internal TI
                                                                                    page has been created to request
                                                                                    unique module IDs */

/* TRNG_CTL Bits */
/* TRNG_CTL[DECIM_RATE] Bits */
#define TRNG_CTL_DECIM_RATE_OFS                  (8)                             /* !< DECIM_RATE Offset */
#define TRNG_CTL_DECIM_RATE_MASK                 ((uint32_t)0x00000700U)         /* !< Set decimation rate. Decimate by n
                                                                                    0x0 = Decimation by 1 (no decimation)
                                                                                    0x1 = Decimation by 2 (Skip every
                                                                                    other sample)  0x7 = Decimation by 8
                                                                                    (Take every 8th sample) */
/* TRNG_CTL[PWRUP_CLKDIV] Bits */
#define TRNG_CTL_PWRUP_CLKDIV_OFS                (16)                            /* !< PWRUP_CLKDIV Offset */
#define TRNG_CTL_PWRUP_CLKDIV_MASK               ((uint32_t)0x00010000U)         /* !< When '1', the powerup sequence will
                                                                                    take twice as long (i.e., clock
                                                                                    frequency halved) */
/* TRNG_CTL[PWRUP_PCHRG_CFG] Bits */
#define TRNG_CTL_PWRUP_PCHRG_CFG_OFS             (17)                            /* !< PWRUP_PCHRG_CFG Offset */
#define TRNG_CTL_PWRUP_PCHRG_CFG_MASK            ((uint32_t)0x00060000U)         /* !< Configure PCHARGE sequence length
                                                                                    b00 = Disabled b01 = 20 us PCHARGE
                                                                                    b10 = 30 us PCHARGE (default) b11 =
                                                                                    40 us PCHARGE */
/* TRNG_CTL[PWRUP_PSTART_CFG] Bits */
#define TRNG_CTL_PWRUP_PSTART_CFG_OFS            (19)                            /* !< PWRUP_PSTART_CFG Offset */
#define TRNG_CTL_PWRUP_PSTART_CFG_MASK           ((uint32_t)0x00180000U)         /* !< Configure pusle startup sequence
                                                                                    length  b00 = Disabled b01 = rise at
                                                                                    10us, fall at 50us b10 = rise at
                                                                                    10us, fall at 70us (default) b11 =
                                                                                    rise at 10us, fall at 90us */
/* TRNG_CTL[CMD] Bits */
#define TRNG_CTL_CMD_OFS                         (0)                             /* !< CMD Offset */
#define TRNG_CTL_CMD_MASK                        ((uint32_t)0x00000003U)         /* !< Sets the TRNG mode through a
                                                                                    command. The mode will not be updated
                                                                                    until the previous command is done,
                                                                                    as indicated by IRQ_CMD_DONE. 00 -->
                                                                                    OFF 01 --> PWRUP_DIG 10 --> PWRUP_ANA
                                                                                    11 --> NORM_FUNC */
#define TRNG_CTL_CMD_PWR_OFF                     ((uint32_t)0x00000000U)         /* !< Turns the power off of the analog
                                                                                    source and clocks the digital
                                                                                    interface */
#define TRNG_CTL_CMD_PWRUP_DIG                   ((uint32_t)0x00000001U)         /* !< Initiates the powerup test sequence
                                                                                    for the digital components. This
                                                                                    verifies that the digital components
                                                                                    are properly working. IRQ_CMD_DONE
                                                                                    indicates that the test is done. The
                                                                                    results of this test are in bits 0:6
                                                                                    in TEST_RESULTS register */
#define TRNG_CTL_CMD_PWRUP_ANA                   ((uint32_t)0x00000002U)         /* !< Initiates the powerup test sequence
                                                                                    for the analog TRNG. This verifies
                                                                                    that the analog component is
                                                                                    generating sequences with enough
                                                                                    entropy. IRQ_CMD_DONE indicates that
                                                                                    the test is done. The results of this
                                                                                    test are in bit 7 in TEST_RESULTS
                                                                                    register */
#define TRNG_CTL_CMD_NORM_FUNC                   ((uint32_t)0x00000003U)         /* !< Normal operating mode for TRNG. All
                                                                                    components are turned on. */

/* TRNG_STAT Bits */
/* TRNG_STAT[ADAP_FAIL] Bits */
#define TRNG_STAT_ADAP_FAIL_OFS                  (0)                             /* !< ADAP_FAIL Offset */
#define TRNG_STAT_ADAP_FAIL_MASK                 ((uint32_t)0x00000001U)         /* !< Indicates that the Adaptive
                                                                                    Proportion Test (1,2,3, or 4-bit
                                                                                    counters) failed by having too many
                                                                                    or too few counted samples in the
                                                                                    last 1024 bit window. */
/* TRNG_STAT[ISSUED_CMD] Bits */
#define TRNG_STAT_ISSUED_CMD_OFS                 (8)                             /* !< ISSUED_CMD Offset */
#define TRNG_STAT_ISSUED_CMD_MASK                ((uint32_t)0x00000300U)         /* !< Indicates the last accepted command
                                                                                    that is issued to the TRNG interface.
                                                                                    Upon writing a valid command, this
                                                                                    register will update and the command
                                                                                    will be in progress until
                                                                                    CMD_DONE_IRQ is set. CMD_DONE_IRQ
                                                                                    indicates that the state is in
                                                                                    PWROFF, NORM_FUNC, or ERROR. These
                                                                                    states will accept new commands. 00
                                                                                    --> OFF 01 --> PWRUP_DIG 10 -->
                                                                                    PWRUP_ANA 11 --> NORM_FUNC */
/* TRNG_STAT[FSM_STATE] Bits */
#define TRNG_STAT_FSM_STATE_OFS                  (16)                            /* !< FSM_STATE Offset */
#define TRNG_STAT_FSM_STATE_MASK                 ((uint32_t)0x000F0000U)         /* !< Current state of the front end FSM
                                                                                    (behind a clock domain crossing). 2
                                                                                    reads are REQUIRED as there is a
                                                                                    chance of metastability when reading
                                                                                    this States: 0000: OFF 0001: PWRUP_ES
                                                                                    0011: NORM_FUNC 0111: TEST_DIG 1011:
                                                                                    TEST_ANA 1010: ERROR 0010: PWRDOWN_ES */
/* TRNG_STAT[REP_FAIL] Bits */
#define TRNG_STAT_REP_FAIL_OFS                   (1)                             /* !< REP_FAIL Offset */
#define TRNG_STAT_REP_FAIL_MASK                  ((uint32_t)0x00000002U)         /* !< Indicates that the repetition
                                                                                    counter test caused the most recent
                                                                                    failure. Thus, the health count
                                                                                    numbers are most likely not for a
                                                                                    complete 1024-bit window. */

