zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_trng.h
/* TRNG_DATA_CAPTURE Bits */
/* TRNG_DATA_CAPTURE[BUFFER] Bits */
#define TRNG_DATA_CAPTURE_BUFFER_OFS             (0)                             /* !< BUFFER Offset */
#define TRNG_DATA_CAPTURE_BUFFER_MASK            ((uint32_t)0xFFFFFFFFU)         /* !< Captured Data from the Decimation
                                                                                    Block */

/* TRNG_TEST_RESULTS Bits */
/* TRNG_TEST_RESULTS[DIG_TEST] Bits */
#define TRNG_TEST_RESULTS_DIG_TEST_OFS           (0)                             /* !< DIG_TEST Offset */
#define TRNG_TEST_RESULTS_DIG_TEST_MASK          ((uint32_t)0x000000FFU)         /* !< Bit 0 indicates if the first
                                                                                    decimation rate test and health
                                                                                    test(verifies conditioning,
                                                                                    decimation, and captured buffer)
                                                                                    fails and Bit 1 indicates if the
                                                                                    second decimation test and health
                                                                                    test fails Bit 0 - decim_test0 (decim
                                                                                    = 0x0) Bit 1 - decim_test1 (decim =
                                                                                    0x1) ... */
/* TRNG_TEST_RESULTS[ANA_TEST] Bits */
#define TRNG_TEST_RESULTS_ANA_TEST_OFS           (8)                             /* !< ANA_TEST Offset */
#define TRNG_TEST_RESULTS_ANA_TEST_MASK          ((uint32_t)0x00000100U)         /* !< Runs through 4096 samples from an
                                                                                    enabled entropy source and verifies
                                                                                    that none of the health tests failed,
                                                                                    indicating sufficient entropy was
                                                                                    produced by the analog components */

/* TRNG_CLKDIVIDE Bits */
/* TRNG_CLKDIVIDE[RATIO] Bits */
#define TRNG_CLKDIVIDE_RATIO_OFS                 (0)                             /* !< RATIO Offset */
#define TRNG_CLKDIVIDE_RATIO_MASK                ((uint32_t)0x00000007U)         /* !< Selects divide ratio of module
                                                                                    clock */
#define TRNG_CLKDIVIDE_RATIO_DIV_BY_1            ((uint32_t)0x00000000U)         /* !< Do not divide clock source */
#define TRNG_CLKDIVIDE_RATIO_DIV_BY_2            ((uint32_t)0x00000001U)         /* !< Divide clock source by 2 */
#define TRNG_CLKDIVIDE_RATIO_DIV_BY_4            ((uint32_t)0x00000003U)         /* !< Divide clock source by 4 */
#define TRNG_CLKDIVIDE_RATIO_DIV_BY_6            ((uint32_t)0x00000005U)         /* !< Divide clock source by 6 */
#define TRNG_CLKDIVIDE_RATIO_DIV_BY_8            ((uint32_t)0x00000007U)         /* !< Divide clock source by 8 */


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_hw_trng__include */
